# Outline: DataFrame Manipulation

other manipulation: 

concat, 

join 

transform a column (Series) to a basic data structure - .tolist(), to_dict(), list(F.col('col')), set() 

shape: .shape, len() 

summary, describe(), info() 

apply function

deep copy

In [1]:
# import packages
import pandas as pd
import re

## Transform - apply function to column(s)

### read the data

In [2]:
read_data_abs_path = '/Users/johnson.huang/py_ds/tutor_python_project/data/titanic/train.csv'  # absolute path
read_data_rel_path = '../data/titanic/train.csv'  # relative path
df_train = pd.read_csv(read_data_rel_path)
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
tmp = df_train.loc[df_train['Name'].str.contains('Mr.')]
tmp.loc[df_train['Name'].str.contains('Mrs\.')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S

In [4]:
print("df_train.loc[df_train['Name'].str.contains('Mr\.')].shape:", 
      df_train.loc[df_train['Name'].str.contains('Mr\.')].shape)

print("df_train.loc[df_train['Sex'] == 'male'].shape:", 
      df_train.loc[df_train['Sex'] == 'male'].shape)

df_train.loc[df_train['Name'].str.contains('Mr\.')].shape: (517, 12)
df_train.loc[df_train['Sex'] == 'male'].shape: (577, 12)

- filter this df for only Mr. ones, in this 'Name' column

> we first create a column called 'is_mr', thus, we need to define a function to distinguish it from the 'Name' column

## regex - regular expression - your best partner to deal with the strings

- ^ matches position just before the first character of the string
- $ matches position just after the last character of the string
- . matches a single character. Does not matter what character it is, except newline
- * matches preceding match zero or more times

In [5]:
def is_mr(name):
    expression_to_use = r'.+Mr\..+'
    if re.match(expression_to_use, name):
        return 1
    else:
        return 0


# create a good habit to do the 'unit test'. At least, you need to ensure your function works as expected
is_mr('Futrelle, Mrs. Jacques Heath (Lily May Peel)')

0

## create a good habit to do the 'unit test'. At least, you need to ensure your function works as expected

- then you can apply it to transform your data

In [6]:
df_train['is_mr'] = df_train.apply(
    lambda row: is_mr(row['Name']),
    axis=1  #  means we apply this function column-wise (axis=1)
)
print("df_train['is_mr'].sum():", df_train['is_mr'].sum())
df_train.head()

df_train['is_mr'].sum(): 517

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,is_mr
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

## Deal with 2 DataFrames

### sql join

![sql_join](https://i.pinimg.com/originals/9c/9c/d9/9c9cd9c0b628505dab25bac65e2a0182.png)

### pandas merge

> https://stackoverflow.com/questions/53645882/pandas-merging-101

> animation - https://github.com/gadenbuie/tidyexplain

![pd_merge]()

In [6]:
# data reference - https://www.kaggle.com/vin1234/merge-join-and-concat-with-pandas
print('-- method 1 to create a dataframe : dictionary')
dummy_data1 = {
    'id': ['1', '2', '3', '4', '5'],
    'Feature1': ['A', 'C', 'E', 'G', 'I'],
    'Feature2': ['B', 'D', 'F', 'H', 'J']
}
df1 = pd.DataFrame(dummy_data1, columns = ['id', 'Feature1', 'Feature2'])
print('df1:\n', df1.to_markdown(tablefmt='grid'))
print('-- method 2 to create a dataframe : nd.array')
# dummy_data2 = {
#         'id': ['1', '2', '6', '7', '8'],
#         'Feature1': ['K', 'M', 'O', 'Q', 'S'],
#         'Feature2': ['L', 'N', 'P', 'R', 'T']}
dummy_data2 = [
    ['1', 'K', 'L'],
    ['2', 'M', 'N'],
    ['6', 'O', 'P'],
    ['7', 'Q', 'R'],
    ['8', 'S', 'T'],
]
df2 = pd.DataFrame(dummy_data2, columns = ['id', 'Feature1', 'Feature2'])
print('df2:\n', df2.to_markdown(tablefmt='grid'))

-- method 1 to create a dataframe : dictionary
df1:
 +----+------+------------+------------+
|    |   id | Feature1   | Feature2   |
+====+======+============+============+
|  0 |    1 | A          | B          |
+----+------+------------+------------+
|  1 |    2 | C          | D          |
+----+------+------------+------------+
|  2 |    3 | E          | F          |
+----+------+------------+------------+
|  3 |    4 | G          | H          |
+----+------+------------+------------+
|  4 |    5 | I          | J          |
+----+------+------------+------------+
-- method 2 to create a dataframe : nd.array
df2:
 +----+------+------------+------------+
|    |   id | Feature1   | Feature2   |
+====+======+============+============+
|  0 |    1 | K          | L          |
+----+------+------------+------------+
|  1 |    2 | M          | N          |
+----+------+------------+------------+
|  2 |    6 | O          | P          |
+----+------+------------+------------+
|  3 |    7 | Q          | R          |
+----+------+------------+------------+
|  4 |    8 | S          | T          |
+----+------+------------+------------+

### inner join

In [7]:
df_inner = df1.merge(df2, on='id', how='inner')
df_inner

  id Feature1_x Feature2_x Feature1_y Feature2_y
0  1          A          B          K          L
1  2          C          D          M          N

### left join

In [9]:
df_left = df1.merge(df2, on='id', how='left', suffixes=('_left', '_right'))
df_left

  id Feature1_left Feature2_left Feature1_right Feature2_right
0  1             A             B              K              L
1  2             C             D              M              N
2  3             E             F            NaN            NaN
3  4             G             H            NaN            NaN
4  5             I             J            NaN            NaN

In [10]:
df_left = df1.merge(df2, left_on='id', right_on='id', how='left', suffixes=('_from_df1', '_from_df2'))
df_left

  id Feature1_from_df1 Feature2_from_df1 Feature1_from_df2 Feature2_from_df2
0  1                 A                 B                 K                 L
1  2                 C                 D                 M                 N
2  3                 E                 F               NaN               NaN
3  4                 G                 H               NaN               NaN
4  5                 I                 J               NaN               NaN

> <font color='#FFCC34'> - give it a try - </font>

- how about merging multiple dataframes? e.g. inner join df1, df2, df3

In [11]:
dummy_data3 = {
        'id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'Feature3': [12, 13, 14, 15, 16, 17, 15, 12, 13, 23]
}
df3 = pd.DataFrame(dummy_data3, columns = ['id', 'Feature3'])
df3

   id  Feature3
0   1        12
1   2        13
2   3        14
3   4        15
4   5        16
5   7        17
6   8        15
7   9        12
8  10        13
9  11        23

In [12]:
# your answer

### concat

![df_concat](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTgpMUpM01WEbIpxCPhHmzS6IGYjTA9id5Yew&usqp=CAU)

In [13]:
df_concat_horiz = pd.concat([df1, df2], axis=1)
print('df_concat_horiz:\n', df_concat_horiz.to_markdown(tablefmt='grid'))
print('--')
df_concat_vrt = pd.concat([df1, df2], axis=0)
print('df_concat_vrt:\n', df_concat_vrt.to_markdown(tablefmt='grid'))

df_concat_horiz:
 +----+------+------------+------------+------+------------+------------+
|    |   id | Feature1   | Feature2   |   id | Feature1   | Feature2   |
+====+======+============+============+======+============+============+
|  0 |    1 | A          | B          |    1 | K          | L          |
+----+------+------------+------------+------+------------+------------+
|  1 |    2 | C          | D          |    2 | M          | N          |
+----+------+------------+------------+------+------------+------------+
|  2 |    3 | E          | F          |    6 | O          | P          |
+----+------+------------+------------+------+------------+------------+
|  3 |    4 | G          | H          |    7 | Q          | R          |
+----+------+------------+------------+------+------------+------------+
|  4 |    5 | I          | J          |    8 | S          | T          |
+----+------+------------+------------+------+------------+------------+
--
df_concat_vrt:
 +----+------+------------+------------+
|    |   id | Feature1   | Feature2   |
+====+======+============+============+
|  0 |    1 | A          | B          |
+----+------+------------+------------+
|  1 |    2 | C          | D          |
+----+------+------------+------------+
|  2 |    3 | E          | F          |
+----+------+------------+------------+
|  3 |    4 | G          | H          |
+----+------+------------+------------+
|  4 |    5 | I          | J          |
+----+------+------------+------------+
|  0 |    1 | K          | L          |
+----+------+------------+------------+
|  1 |    2 | M          | N          |
+----+------+------------+------------+
|  2 |    6 | O          | P          |
+----+------+------------+------------+
|  3 |    7 | Q          | R          |
+----+------+------------+------------+
|  4 |    8 | S          | T          |
+----+------+------------+------------+

## to python basic data structures

In [14]:
df1.head()

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J

### to list

In [15]:
df1['id'].tolist()

['1', '2', '3', '4', '5']

### to dict

In [16]:
df_set_index = df1.set_index(['id'])['Feature1']
print('df_set_index:\n', df_set_index.to_markdown(tablefmt='grid'))
print(df_set_index.index)

df_set_index:
 +------+------------+
|   id | Feature1   |
+======+============+
|    1 | A          |
+------+------------+
|    2 | C          |
+------+------------+
|    3 | E          |
+------+------------+
|    4 | G          |
+------+------------+
|    5 | I          |
+------+------------+
Index(['1', '2', '3', '4', '5'], dtype='object', name='id')

In [17]:
df1.set_index(['id'])['Feature1'].to_dict()

{'1': 'A', '2': 'C', '3': 'E', '4': 'G', '5': 'I'}

In [18]:
df1.to_dict('records')

[{'id': '1', 'Feature1': 'A', 'Feature2': 'B'},
 {'id': '2', 'Feature1': 'C', 'Feature2': 'D'},
 {'id': '3', 'Feature1': 'E', 'Feature2': 'F'},
 {'id': '4', 'Feature1': 'G', 'Feature2': 'H'},
 {'id': '5', 'Feature1': 'I', 'Feature2': 'J'}]

In [ ]:
df.to_dict

### to set

In [17]:
set(df1['id'])

5

In [22]:
df1['id'].unique()

array(['1', '2', '3', '4', '5'], dtype=object)

In [21]:
df1['id'].nunique()

5

In [23]:
len(df1['id'].unique())

5

In [22]:
len(set(df1['id']))

5

# your turn

- use df_train to practice

### if you have trouble with the file path...

In [78]:
import os 
os.getcwd()

'/Users/johnson.huang/py_ds/tutor_python_project/notebooks'

In [79]:
'Users' + os.sep + 'johnson.huang'

'Users/johnson.huang'

### read the data

In [24]:
data_path_to_read_1 = '/Users/johnson.huang/py_ds/tutor_python_project/data/titanic/train.csv'  # absolute path
data_path_to_read_2 = '../data/titanic/train.csv'  # relative path
df_train = pd.read_csv(data_path_to_read_2)
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

> <font color='#FFCC34'> - give it a try - </font>

- select all rows (records) with 'Ticket' starts with A-Z alphabets, not integers

In [31]:
import re
def starts_with_alphabet(inupt_string):
    if re.match(r'^[A-Z].+', inupt_string):
        return 1
    else:
        return 0
starts_with_alphabet('PC 17599')

1